## Day 1 Exercises

In [65]:
import pandas as pd
import numpy as np
import pydataset
import acquire
import warnings
warnings.filterwarnings('ignore')

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import MinMaxScaler

### 1. ) Use a python module containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
df_iris = pd.DataFrame(pydataset.data('iris'))

Print the first 3 rows:

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

Print the number of rows and columns:

In [4]:
df_iris.shape

(150, 5)

Print the column names:

In [5]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

Print the data type of each column:

In [6]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

Print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics? Yes, because sepal length and width are proportionally much larger than petal length and petal width.

In [7]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 2. ) Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [8]:
df_excel = pd.read_excel('Excel_Exercises.xlsx', index_col=0)

Assign the first 100 rows to a new dataframe, df_excel_sample:

In [9]:
df_excel_sample = df_excel.head(100)

Print the number of rows of your original dataframe:

In [10]:
df_excel.shape

(7049, 11)

Print the first 5 column names:

In [11]:
df_excel.columns

Index(['gender', 'is_senior_citizen', 'partner', 'dependents', 'phone_service',
       'internet_service', 'contract_type', 'payment_type', 'monthly_charges',
       'total_charges', 'churn'],
      dtype='object')

Print the column names that have a data type of object:

In [12]:
df_excel.dtypes == 'object'

gender                True
is_senior_citizen    False
partner               True
dependents            True
phone_service        False
internet_service     False
contract_type        False
payment_type          True
monthly_charges      False
total_charges        False
churn                 True
dtype: bool

Compute the range for each of the numeric variables.:

In [13]:
df_excel.dtypes

gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
dtype: object

### 3. ) Read the data from this google sheet into a dataframe, df_google

In [14]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_googlesheet = pd.read_csv(csv_export_url)

Print the first 3 rows:

In [15]:
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Print the number of rows and columns:

In [16]:
df_googlesheet.shape

(891, 12)

Print the column names:

In [17]:
df_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Print the data type of each column:

In [18]:
df_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Print the summary statistics for each of the numeric variables:

In [19]:
df_googlesheet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Print the unique values for each of your categorical variables:

In [29]:
print('Survived:', df_googlesheet.Survived.unique())
print('Pclass:', df_googlesheet.Pclass.unique())
print('Sex:', df_googlesheet.Sex.unique())
print('SibSp:', df_googlesheet.SibSp.unique())
print('Embarked:', df_googlesheet.Embarked.unique())

Survived: [0 1]
Pclass: [3 1 2]
Sex: ['male' 'female']
SibSp: [1 0 3 4 2 5 8]
Embarked: ['S' 'C' 'Q' nan]

## Day 2 Exercises

### 1. ) Iris Data

#### Use the function defined in acquire.py to load the iris data.

In [21]:
iris = acquire.get_iris_data()
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

#### Drop the species_id and measurement_id columns.

In [22]:
iris.drop(columns=['species_id', 'measurement_id'], inplace = True)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

#### Rename the species_name column to just species.

In [30]:
iris.rename(columns={'species_name':'species'}, inplace = True)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width  species
0           5.1          3.5           1.4          0.2        0
1           4.9          3.0           1.4          0.2        0
2           4.7          3.2           1.3          0.2        0
3           4.6          3.1           1.5          0.2        0
4           5.0          3.6           1.4          0.2        0

#### Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?

In [31]:
# Assign a variable to the encoder
int_encoder = LabelEncoder()
# Fit the encoder to our species column from our train data
int_encoder.fit(iris.species)
# Transform the data and save over the old
iris.species = int_encoder.transform(iris.species)

The inverse_tranform method transforms labels back to original encoding. This would be useful in presenting data.

#### Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [32]:
def prep_iris(iris):
    int_encoder = LabelEncoder()
    int_encoder.fit(iris.species)
    iris.species = int_encoder.transform(iris.species)
    return iris

### 1. ) Titanic Data

#### Use the function you defined in acquire.py to load the titanic data set.

In [35]:
titanic = acquire.get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

#### Handle the missing values in the embark_town and embarked columns.

In [39]:
# Check how many missing values are in each column
titanic.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [46]:
# Fill empty cells with Nan
titanic.fillna(np.nan, inplace=True)

In [47]:
# Fill in missing values in embarked and embark_town with mode imputer

In [49]:
imputer_mode = SimpleImputer(missing_values=np.nan, strategy = 'most_frequent')
titanic['embarked'] = imputer_mode.fit_transform(titanic[['embarked']])
titanic['embark_town'] = imputer_mode.fit_transform(titanic[['embark_town']])

In [51]:
# Check again for missing values
titanic.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
deck            688
embark_town       0
alone             0
dtype: int64

#### Remove the deck column.

In [52]:
titanic.drop(columns=['deck'], inplace = True)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1

#### Use a label encoder to transform the embarked column.

In [60]:
# Assign a variable to the encoder
titanic_int_encoder = LabelEncoder()
# Fit the encoder to our species column from our train data
titanic_int_encoder.fit(titanic.embark_town)
# Transform the data and save over the old
titanic.embark_town = titanic_int_encoder.transform(titanic.embark_town)
# Preview the column. Embark town is now integers that represent the original embarkment locations
titanic.embark_town.head()

0    2
1    0
2    2
3    2
4    2
Name: embark_town, dtype: int64

#### Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

Scaling is beneficial when you have features that vary greatly in magnitude. It prevents the algorithm from discriminating on size. You won't need to do this when your features are similar in size or use the same units. You also wouldn't want to use scaled data in charts.

In [84]:
# Handle nulls in age
imp_median = SimpleImputer(missing_values=np.nan, strategy = 'median')
titanic['age'] = imp_median.fit_transform(titanic[['age']])
# Assign MinMaxScaler to a variable
scaler = MinMaxScaler()

In [86]:
# Scale age
titanic['age'] =scaler.fit_transform(titanic[['age']])

In [87]:
# Scale fare
titanic['fare'] = scaler.fit_transform(titanic[['fare']])

In [88]:
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,0.271174,1,0,0.014151,S,Third,2,0
1,1,1,1,female,0.472229,1,0,0.139136,C,First,0,0
2,2,1,3,female,0.321438,0,0,0.015469,S,Third,2,1
3,3,1,1,female,0.434531,1,0,0.103644,S,First,2,0
4,4,0,3,male,0.434531,0,0,0.015713,S,Third,2,1

#### Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [63]:
def prep_titanic(iris):
    int_encoder = LabelEncoder()
    int_encoder.fit(titanic.embark_town)
    titanic.embark_town = int_encoder.transform(titanic.embark_town)
    return titanic